**Free                          
                                
       Dcl-S  Number Zoned(5:0);
       Dcl-S  Str  Char(5);     
                                
       Dsply 'Start';           
       Number = 99;             
       Str = 'Hi';              
       Dsply  Number;           
       Dsply  Str;              
       *inlr = *on;             
